[
    {
        "User": "Nolene A.",
        "Stars": "5",
        "Date": "12/05/2023",
        "id": "4243",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#4243",
        "Titles": "Great communication!",
        "Details": "Found this site via a travel search engine and was initially unsure as hadn't heard of them. However, booking went smoothly and I secured the best price around when I booked by a lot! Emails and WhatsApp messages were really informative and helpful, and checking in at the Hilton was easy. Plus, I shared my discount code for booking with a friend who also used their site and likewise had a similar smooth experience. Definitely would book via super.com again"
    },
    {
        "User": "Randi P.",
        "Stars": "5",
        "Date": "11/02/2023",
        "id": "3622",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3622",
        "Titles": "Pleasantly Surprised!",
        "Details": "I had an electrical emergency at home and needed to stay at a local hotel overnight. I googled the hotel, and saw Super.com's price was $15 less than all the other sites AND the direct booking! Took 5 minutes to book and sign up for the super+ rewards. I have already mentioned it to several friends to use as well. Best google find EVER!"
    },
    {
        "User": "Elliot M.",
        "Stars": "5",
        "Date": "12/01/2023",
        "id": "4183",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#4183",
        "Titles": "Best Price By Far!",
        "Details": "I did a Google Search and got the best price by far! I would just beware for anybody using this that there are lots of extras they tack on like paying for a full refund, request for tip. It's alright the business is legit. I'll give it a try and if all goes well I'll start tipping."
    },
    {
        "User": "Nhlo X.",
        "Stars": "4",
        "Date": "09/08/2023",
        "id": "2509",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#2509",
        "Titles": "Saved on hotel stay",
        "Details": "I've used them twice and both times it's worked well for me. I save on the rooms. Even if it's a little. Saving, it goes a long way. No funny business. I hope it can be this good to always I don't usually write reviews. Only when something is bad, but just wanted to do a positive one for a change. Thank you Super Save. Oh though I chose a cheaper option for the room with 2 beds,the hotel was nice enough to upgrade me to a king at no extra charge. It was nice and much appreciated"
    },
    {
        "User": "Jesse T.",
        "Stars": "5",
        "Date": "10/10/2023",
        "id": "3154",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3154",
        "Titles": "Saves me money!",
        "Details": "Generally the cheapest site for hotels when I'm traveling. On the road 25 days a month and use Super as much as possible. Nothing bad to say."
    },
    {
        "User": "Gena L.",
        "Stars": "5",
        "Date": "10/03/2023",
        "id": "3052",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3052",
        "Titles": "Great Site!",
        "Details": "I was out of town and needed a Last minute room.\nCalled a few hotels, prices were really high and I only needed 1 night. Never heard of Super.com took a chance and so glad I did. They saved me close to 100$ and within mins I had a great room in a embassy suites, free cook to order breakfast, comfy beds, great pillows and at 9pm they even had a restaurant and bar open. Great food BTW.\nWill definitely use this site again!"
    },
    {
        "User": "Jason G.",
        "Stars": "5",
        "Date": "11/19/2023",
        "id": "3967",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3967",
        "Titles": "Excellent",
        "Details": "Was very simple and quick and got a great price on a great room and no complications when arriving for check in just showed my ID and got my key easy as that very nice other sites I have used I have had issues at check in and have to show confirmation number and what not this time I didn't have to do anything only waited at desk because there were people in front of me I got my key and was in room with in minutes"
    },
    {
        "User": "Shirley W.",
        "Stars": "5",
        "Date": "09/18/2023",
        "id": "2728",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#2728",
        "Titles": "Nieces wedding",
        "Details": "Super.com is the greatest it help me out with a last-minute reservation. Everything was booked so when I found the room put it in the information they sent to me, chose which package that was available and great for my needs It was great. No problems 1. Checked in 2. Showed my receipt 3. Signed In for my room just that easy my receipt online came from Super.com that day as well and I was very happy thank you Super.com, because without you, I would have missed a very very important date to me. ( My Nieces Wedding)."
    },
    {
        "User": "L K.",
        "Stars": "1",
        "Date": "11/20/2023",
        "id": "3865",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3865",
        "Titles": "Worst company",
        "Details": "Waited almost 2 hours to check than was turned away due to the fact a $100 deposit was NOT disclosed until reservation was confirmed. Refund or change reservation was not excepted. Tried to use cash for deposit was refused. Had to slept in vehicle after being in ICU for kidney failure. Only wanted to spend our anniversary in a special way with all the negative things happening. Even got a flat tire on our way there"
    },
    {
        "User": "Reggie G.",
        "Stars": "3",
        "Date": "11/06/2023",
        "id": "3070",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3070",
        "Titles": "True Total Review from Extensive Super.com User",
        "Details": "For saving money, they are perhaps the best travel website and I've used dozens of various travel sites. I travel weekly. I've never had an overbook or stay issue. ** However, their customer service is not very good at all. You may wait a couple of hours to reach someone. When you do, you can tell they are in another country. But they don't seem to have any knowledge in resolving problems. They just give repeated statements with no research effort. One problem I had since they changed from Snaptravel to Supertravel is the earned $$ you accumulate from your stays. It's connected to your phone #. They now mandate you download their app in order to use those funds you've earned. The app never sends out 4-digit text message to confirm my phone number. Customer Service says it's my phone. The Geek squad at Best Buy went through my phone and other messages and says it is Super.com's app communication that is having the problem. The website can confirm the number and sends me texts all the time (same company). Almost seems like they are trying to keep me (customer) from using my earned $$. It worked fine on the mobile website. Customer Service manager says \"no, you have to use a different phone number.\" I asked why? She said because your phone doesn't work. Sound fishy? The earned $$ is tied to the number that I've been using. If enough people make noise about it they will have to do something.\n\nAgain, discounted lodging = the best. Customer service and web support = the bottom."
    },
    {
        "User": "Dr. Hawkins H.",
        "Stars": "5",
        "Date": "10/23/2023",
        "id": "3448",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3448",
        "Titles": "Super everything!",
        "Details": "From booking to the four free fantastic breakfasts Super negotiated next we have the makes too much sense invoice where all charges are easily identified and only pertinent emails not a lot of marketing oh let's not forget the best price in lower Manhattan New York. Thank you Super.com keep up the good work."
    },
    {
        "User": "Sonya L.",
        "Stars": "1",
        "Date": "11/21/2023",
        "id": "3901",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3901",
        "Titles": "Bad business. Worst communication ever!",
        "Details": "Don't use this site, Seriously. This is a site made up of people who have very poor customer service skills. They stole my money. Don't use this site to Book anything. It's unclear on their confirmation page regards to my room rental. Now I get No money back.they don't bother to help you. They just give bad confirmation information and take your money. Skip this site. It's horrible, just watch."
    },
    {
        "User": "Ann W.",
        "Stars": "4",
        "Date": "10/24/2023",
        "id": "3454",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3454",
        "Titles": "Good except for cancellation policy",
        "Details": "Everything excellent apart from we chose to pay for cancellation policy, which we normally don't, only to find it didn't cover covid …. Only random things like complications with pregnancy ( m 71), redundancy ( I'm retired) etc.etc.and only up to a few days before.\n\nFortunately we did not need to cancel so could have saved ourselves some money.\nThe breakfast was outstanding - everything you could possibly want and all fresh- thank you."
    },
    {
        "User": "Christopher L.",
        "Stars": "5",
        "Date": "10/07/2023",
        "id": "3100",
        "Source_url": "https://www.sitejabber.com/reviews/super.com#3100",
        "Titles": "Needed a quick solution in Missouri - rescued by Super!",
        "Details": "Learned about Super searching for hotels near me after 9pm when I exited the interstate where many hotels were listed as options on the highway signs.\n\nSuper gave me a great rate for Auburn Place Hotels (~$100). As a frequent air traveler across the USA, this is about 1/3 the average price I have to pay, even though the room was an excellent value.\n\nI will check Super first next time I need a room!"
    }
]